Autodesk.Revit.DB.ElementIdParameterValue.Value
The stored value
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2016 Subscription Update

Autodesk.Revit.DB.ElementIdParameterValue.#ctor(Autodesk.Revit.DB.ElementId)
Value constructor
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016 Subscription Update